import { Component, signal } from '@angular/core';

@Component({
  selector: 'app-faq',
  standalone: true,
  imports: [],
  templateUrl: './faq.html',
  styleUrl: './faq.css',
})
export class Faq {
  // স্মার্টলি ট্র্যাক করার জন্য সিগন্যাল
  openIndex = signal<number | null>(null);

  faqs = [
    { 
      q: 'যেখানে ২,০০০-৫,০০০ টাকায় ওয়েবসাইট পাওয়া যায়, সেখানে আপনাদের ওয়েবসাইটের মূল্য ২০,০০০ টাকা কেন?', 
      a: 'আমরা আপনাকে শুধু একটি ওয়েবসাইট দিই না, বরং একটি হাই-পারফর্মিং বিজনেস টুল দিই যা কাস্টম কোডেড এবং সিকিউর।' 
    },
    { 
      q: 'হোস্টিং তো ১,০০০-২,০০০ হাজার টাকায় পাওয়া যায়, সেখানে আপনাদের রিনিউয়াল ১০০০০ টাকা কেন?', 
      a: 'আমাদের সার্ভার ডেডিকেটেড রিসোর্স ব্যবহার করে, যা আপনার সাইটকে ৯৯.৯% আপটাইম এবং সুপার-ফাস্ট স্পিড নিশ্চিত করে।' 
    },
    { 
      q: 'Eduman এর ৩ টি প্যাকেজ দেখতে পাচ্ছি। এর মধ্যে কোনটি আপনারা রেকমেন্ড করেন?', 
      a: 'আপনার প্রতিষ্ঠানের ইউজার সংখ্যা এবং প্রয়োজনীয় ফিচারের ওপর ভিত্তি করে আমরা আপনার জন্য সেরা প্যাকেজটি বেছে দিতে সাহায্য করি।' 
    },
    { 
      q: 'শিক্ষার্থী প্রতি মাসিক এর পরিবর্তে বার্ষিক বা দ্বিবার্ষিক অগ্রীম বিল পেমেন্টে ডিসকাউন্ট পাব কিনা?', 
      a: 'জি অবশ্যই! বার্ষিক পেমেন্টে আপনি আকর্ষণীয় ডিসকাউন্ট এবং সাথে ফ্রি মেইনটেন্যান্স সাপোর্ট পাবেন।' 
    },
    { 
      q: 'মানি ব্যাক গ্যারান্টির ক্ষেত্রে মানি ব্যাক পাব কিভাবে এবং কতদিনের মধ্যে?', 
      a: 'আমাদের সার্ভিসে সন্তুষ্ট না হলে ৩০ দিনের মধ্যে সরাসরি রিফান্ড রিকোয়েস্ট করতে পারবেন। কোনো প্রশ্ন ছাড়াই রিফান্ড প্রসেস করা হবে।' 
    }
  ];

  toggle(index: number) {
    this.openIndex.set(this.openIndex() === index ? null : index);
  }
}